# Taps we need to make this all work
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Install Packages
brew "bash"
brew "benchmark"
brew "bo"
brew "boost"
brew "bost"
brew "cdargs"
brew "cmake"
brew "findutils"
brew "gcc"
brew "gcc"
brew "gimp"
brew "google-benchmark"
brew "gpg-agent"
brew "htop"
brew "matplotlib"
brew "modules"
brew "ninja"
brew "nvm"
brew "open-mpi"
brew "openblas"
brew "pdflatex"
brew "pinentry-mac"
brew "readline"
brew "rename"
brew "tig"
brew "tmux"
brew "tree"
brew "updatedb"
brew "vlc"
brew "wget"

# Install Apps
cask "emacs"
cask "font-terminus"
cask "gimp"
cask "mactex"
cask "matplotlib"
cask "vlc"
